# Velocity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..Velocity Property
DuctPressureDropData Class See Also
---
The velocity of the duct. Units: (ft/s).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Velocity { get; set; }
```

Visual Basic
---
```text
Public Property Velocity As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Velocity {
	double get ();
	void set (double value);
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace